eisup_2019_docmng_integration/src/BusinessProcesses/абсЗакрытиеДоговоров/абсЗакрытиеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсЗакрытиеДоговоров</name>
  <comment>54270</comment>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абсЗакрытиеДоговоров/ObjectModule.bsl
// Процедуры обработчики ИнтерактивнойАктивации
Процедура УтверждениеЗакрытияОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорКонтрагента,Задача);

КонецПроцедуры

Процедура ОткрытьФормуДоговора(ДоговорКонтрагента,Задача) Экспорт
	//Если НЕ ДоговорКонтрагента.Пустая() Тогда
	//	ФормаДоговора=ДоговорКонтрагента.ПолучитьФорму("ФормаЭлемента",,Неопределено);
	//	ФормаДоговора.КлючУникальности=Задача;
	//	Если НЕ ФормаДоговора.Открыта() Тогда
	//		ФормаДоговора.Открыть();
	//	КонецЕсли;
	//КонецЕсли;
	Если НЕ ДоговорКонтрагента.Пустая() Тогда
			
		КонтрагентОбъект = ДоговорКонтрагента.ПолучитьОбъект();
		
		ФормаКонтрагента = ДоговорКонтрагента.ПолучитьФорму("ФормаЭлемента",,ДоговорКонтрагента);
		//ФормаКонтрагента.КлючУникальности = Задача;
		
		Если ФормаКонтрагента.Открыта() Тогда
			ФормаКонтрагента.Активизировать();
		Иначе
			ФормаКонтрагента.Открыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедуры проверки условий
Процедура УсловиеСогласованоБухгалтериейПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорКонтрагента.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Закрыт;
			
КонецПроцедуры

// Процедуры используемые для создания групповых задач
Процедура УтверждениеЗакрытияБухгалтериейПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
	                                  |	РолиИИсполнители.Исполнитель
	                                  |ИЗ
	                                  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                                  |ГДЕ
	                                  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	РольИсполнителей = Неопределено;									  
	Если ТочкаМаршрута = БизнесПроцессы.абсЗакрытиеДоговоров.ТочкиМаршрута.УтверждениеЗакрытияБухгалтерией Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеБухгалтером;
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсЗакрытиеДоговоров.ТочкиМаршрута.УтверждениеЗакрытияПД Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеПД;
	КонецЕсли;
	
	Если РольИсполнителей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	//абс изменение Урал 28.01.2014: Формирование одной задачи 
	Если ВыборкаИсполнителей.Количество() Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
		//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи 
		//	+ " ("+СокрЛП(Контрагент.Наименование) + " :" + СокрЛП(ДоговорКонтрагента.Наименование) + ")";
		НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + ": " + СокрЛП(ДоговорКонтрагента.Наименование) + " " 
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		НоваяЗадача.Роль			    = РольИсполнителей;
		
		НоваяЗадача.ОбъектЗадачи 		= ДоговорКонтрагента;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	КонецЕсли;
	//\\абс Урал 28.01.2014
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ДоговорКонтрагента, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура Завершение2ПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗавершитьБП(ДоговорКонтрагента.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗавершитьБП(СтатусЗавершения)
	
	абс_БизнесПроцессыПривелегированный.ЗавершитьБПСогласованияДоговора(ДоговорКонтрагента, СтатусЗавершения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Организация = ДоговорКонтрагента.Организация;
		
	КонецЕсли;
	
КонецПроцедуры
